Revit 2024 API
BuiltInFailures.WallFailures.ShorterThanMinWall Property
 Wall is shorter than minimum height allowed by its type.\nIt is [Length] and must be at least [Length].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ShorterThanMinWall { get; }
Visual Basic
Public Shared ReadOnly Property ShorterThanMinWall As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ShorterThanMinWall {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace